---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetBasicIEnumerator
source: html/52ead6fa-0234-1689-518f-82ab16fe4a18.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.